use Buev;

insert into gender values
('мужской'),
('женский');

insert into employee values
('Тимур', 'Зуев', 'Кириллович', 1),
('Матвей', 'Карпов', 'Данилович', 1),
('Андрей', 'Федосов', 'Владимирович', 1),
('Маргарита', 'Маслова', 'Тимофеевна', 2),
('Елизовета', 'Савельева', 'Александоровна', 2),
('Лев', 'Кожевников', 'Миронович', 1),
('Роборт', 'Антонов', 'Дмитриевич', 1),
('Злата', 'Новикова', 'Тимофеевна', 2),
('Ульяна', 'Некрасова', 'Глебовна', 2),
('Дмитрий', 'Егоров', 'Данилович', 1),
('Мария', 'Жданова', 'Тихоновна', 2),
('Иван', 'Михайлов', 'Тимофеевич', 1),
('Аделина', 'Белова', 'Захаровна', 2),
('Артем', 'Максимов', 'Артемович', 1),
('Киррил', 'Михайлов', 'Николаевич', 1),
('Анна', 'Киселева', 'Львовна', 2),
('Артем', 'Калмыков', 'Данилович', 1),
('Валерия', 'Иванова', 'Ивановна', 2),
('Полина', 'Зорина', 'Александровна', 2),
('Есения', 'Никольская', 'Тимофеевна', 2);

insert into machineType values
('Токарно-винторезный'),
('Сверлильный'),
('Расточный'),
('Шлифовальный'),
('Притирочный'),
('Хонинговальный'),
('Зубообрабатывающий'),
('Фрейзерный'),
('ЧПУ');

insert into machine values
('c3c9m2xm39','2022-11-01', '2 года', '2024-11-01', 1),
('2c968749','2024-11-01', '3 года', NULL, 1),
('x794 m00','2022-11-02', '1.5 года', '2024-11-02', 2),
('57m894','2024-11-02', '2 года', NULL, 2),
('9x83n403','2022-11-03', '2.5 года', '2024-11-03', 3),
('z293 74','2024-11-03', '8 месяцев', NULL, 3),
('x93m7','2022-11-04', '11 месяцев', '2024-11-04', 4),
('92c6573','2024-11-04', '3 года', NULL, 4),
('c74bc764','2022-11-05', '4 года', '2024-11-05', 5),
('x84n5m','2024-11-05', '2 месяца', NULL, 5),
('xserm','2022-11-06', '2 месяца', '2024-11-06', 6),
('x5780','2024-11-06', '3 месяца', NULL, 6),
('x7n','2022-11-07', '5 лет', '2024-11-07', 7),
('9c2n0','2024-11-07', '3 года', NULL, 7),
('cn73cdeasd','2022-11-08', '2 года', '2024-11-08', 8),
('x930','2024-11-08', '3 года', NULL, 8),
('lxsk78','2022-11-09', '1 год', '2024-11-09', 9),
('x20j3','2024-11-09', '1 год', NULL, 9),
('0lk7','2020-12-01', '5 лет', '2022-12-01', 3),
('78h52349','2020-01-01', '7 лет', '2022-12-01', 7);

insert into street values 
('Пушкина'),
('Чкалова'),
('Гагарина'),
('8 марта'),
('Терешковой'),
('Березовая'),
('Уральская'),
('Тополева'),
('Салмышская'),
('Дальнореченская');

insert into warehouse values
('1', '1А', 300, 1),
('2', '43', 236, 2),
('3', '12', 423, 3),
('4', '7', 643, 4),
('5', '34', 278, 5),
('6', '2', 343, 6),
('7', '6', 744, 7),
('8', '3', 1495, 8),
('9', '7', 359, 9),
('10', '89', 657, 10);

insert into detail values
('834', '1'),
('c90di', '2'),
('c034j', '3'),
('x24c59', '4'),
('e74n', '5'),
('cciju', '6'),
('c90', '7'),
('c98', '8'),
('8s3', '9'),
('v7', '10'),
('xdb63', '11'),
('9sdj', '12'),
('e987', '13'),
('3cs', '14'),
('93m', '15'),
('djf7', '16'),
('94e8', '17'),
('dfk2', '18'),
('dk2', '19'),
('skd2', '20');

insert into detailForMachins values
(1,1),
(2,2),
(3,3),
(4,4),
(5,5),
(6,6),
(7,7),
(8,8),
(9,9),
(10,10),
(11,11),
(12,12),
(13,13),
(14,14),
(15,15),
(16,16),
(17,17),
(18,18),
(19,19),
(20,20);

insert into invoice values
(1,1,1,'2024-01-18',234.3),
(2,2,2,'2024-03-22',553),
(3,3,3,'2024-02-12',2389),
(4,4,4,'2024-06-09',344),
(5,5,5,'2024-02-03',2836),
(6,6,6,'2024-08-05',564),
(7,7,7,'2024-11-23',648),
(8,8,8,'2024-02-12',897),
(9,9,9,'2024-12-02',678),
(10,10,10,'2024-04-05',764);